app/Http/Controllers/PostController.php

    public function index()
    {
        //
        // 3. latestメソッドがおすすめ
        $posts = Post::latest()->paginate(5);
---
select * from `posts` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `posts`

    public function store(Request $request)
    {
        //
        $post = new Post;
        $post->title = $request->title;
        $post->body = $request->body;
        $post->save();
---
insert into `posts` (`title`, `body`, `updated_at`, `created_at`) values ('aaas', 'aasa', '2017-11-06 15:43:19', '2017-11-06 15:43:19')